"""
张量索引
分类
简单行列索引***
列表索引
范围索引***
布尔索引
多维索引***
"""
import torch
#设置随机种子
torch.manual_seed(8)
#创建随机张量
t1=torch.randint(1,10,(5,5))
print(f't1={t1}')
#张量索引 获取第二行
print(t1[1])
print(t1[1,:])#效果同上
print(t1[:,3])#获取第四列
#简单行列索引 前面表示行，后面表示列
print(t1[[1,2],[3,4]])#（1，3）和（2，4）的元素
#列表索引索 引所有23行的
print(t1[[[1],[2]],[3,4]])
#范围索引 前三行 前二列
print(t1[:3,:2])
print(t1[1:,:2])#****第二行到最后一行，前二列
print(t1[1::2,::2])#所有奇数行，偶数列
#布尔索引
#print(t1[torch.tensor([True,False,True,False,True,False,True,False,True,False]),:])
print(t1[t1[:,2]>5])#第三列，大于五的行数据
#理解一：在第二行的基础上，找到该行中大于五的列索引，然后找所有行中对应的元素
print(t1[:,t1[1,:]>5])
print(t1[:,t1[1]>5])#效果同上
#理解二：在第二行的基础上，找改行所有列中大于五的元素
print(t1[1,t1[1,:]>5])
#多维索引
t2=torch.randint(1,10,[2,2,3])#2个两行三列的张量
print(f't2={t2}')
print(t2[0,:,:])#0轴上的第一个数据
print(t2[:,0,:])#1轴上的第一个数据
print(t2[:,:,0])#二轴上的第一个数据


